Repository: ministryofjustice/money-to-prisoners-common
Catalog: mtp_common/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Prisoner money
cy: Arian carcharor

source: Please try again.
cy: Rhowch gynnig arall arni.

source: Make sure you haven’t disabled cookies.
cy: Gwnewch yn siŵr nad ydych wedi analluogi cwcis.

source: Make sure you are using a modern web browser such as Firefox or Google Chrome.
cy: Gwnewch yn siŵr eich bod yn defnyddio porwr gwe modern megis Firefox neu Google Chrome.

source: Your browser failed a security check.
cy: Mi wnaeth eich porwr fethu gwiriad diogelwch.

source: Username
cy: Enw defnyddiwr

source: Password
cy: Cyfrinair

source: You’ve entered an incorrect username and/or password
cy: Rydych wedi nodi enw defnyddiwr a/neu gyfrinair anghywir

source: You don’t have access to this application
cy: Nid oes gennych fynediad i'r adnodd hwn

source: This service is currently unavailable
cy: Nid yw'r gwasanaeth hwn ar gael ar hyn o bryd

source: You’ve entered different passwords
cy: Rydych wedi nodi cyfrineiriau gwahanol

source: Old password
cy: Hen gyfrinair

source: New password
cy: Cyfrinair newydd

source: New password confirmation
cy: Cadarnhau eich cyfrinair newydd

source: Username or email address
cy: Enw defnyddiwr neu gyfeiriad e-bost

source: Home
cy: Cartref

source: Logged out
cy: Rydych wedi allgofnodi

source: Change password
cy: Newid cyfrinair

source: Reset password
cy: Ailosod cyfrinair

source: Go to the Ministry of Justice homepage
cy: Ewch i dudalen gartref y Weinyddiaeth Cyfiawnder

source: Ministry of Justice
cy: Y Weinyddiaeth Cyfiawnder

source: Go to the GOV.UK homepage
cy: Ewch i dudalen gartref GOV.UK

source: Skip to main content
cy: Neidio i'r prif gynnwys

source: © Crown copyright
cy: © Hawlfraint y Goron

source: Your feedback could not be sent, please try again later
cy: Nid oedd yn bosib anfon eich adborth, rhowch gynnig arall arni hwyrach ymlaen

source: This field is required
cy: Rhaid llenwi’r maes hwn

source: You’ve entered too few characters
cy: Nid ydych wedi nodi digon o nodau

source: You’ve entered too many characters
cy: Rydych wedi nodi gormod o nodau

source: Enter a whole number
cy: Nodwch gyfanrif

source: Enter a number
cy: Nodwch rif

source: Enter a valid date
cy: Nodwch ddyddiad dilys

source: Enter a valid time
cy: Nodwch amser dilys

source: Enter a valid date and time
cy: Nodwch ddyddiad ac amser dilys

source: No file was submitted
cy: Ni anfonwyd ffeil

source: The submitted file is empty
cy: Mae'r ffeil a anfonwyd yn wag

source: Enter a valid email address
cy: Nodwch gyfeiriad e-bost dilys

source: ‘Year’ should be between 1900 and %(current_year)s
cy: Dylai ‘Blwyddyn’ fod rhwng 1900 ac %(current_year)s

source: Enter ‘year’ as a number
cy: Nodwch ‘blwyddyn’ fel rhif

source: ‘Day’ should be between 1 and 31
cy: Dylai 'Diwrnod' fod rhwng 1 ac 31

source: ‘Month’ should be between 1 and 12
cy: Dylai 'Mis' fod rhwng 1 a 12

source: Enter ‘day’ as a number
cy: Nodwch 'diwrnod' fel rhif

source: Enter ‘month’ as a number
cy: Nodwch 'mis' fel rhif

source: Sign in
cy: Mewngofnodi

source: Send money to someone in prison
cy: Anfon arian at rywun sydd yn y carchar

source: Forgotten your password?
cy: Wedi anghofio eich cyfrinair?

source: Change your password
cy: Newid eich cyfrinair

source: Submit
cy: Anfon

source: Password change successful
cy: Mae'r cyfrinair wedi cael ei newid

source: Your password has been changed.
cy: Mae eich cyfrinair wedi cael ei newid.

source: Return to the home page
cy: Dychwelyd i'r dudalen gartref

source: Reset your password
cy: Ailosod eich cyfrinair

source: Sorry, something went wrong
cy: Mae'n ddrwg iawn gennym, aeth rhywbeth o'i le

source: There was a problem with your request.
cy: Roedd yna broblem gyda'ch cais.

source: Page not found
cy: Ni ellir dod o hyd i’r dudalen

source: If you entered a web address please check it was correct.
cy: Os gwnaethoch nodi cyfeiriad gwefan yna gwiriwch ei fod yn gywir.

source: Please try again later.
cy: Rhowch gynnig arall arni hwyrach ymlaen.

source: Back
cy: Yn ôl

source: Feedback details
cy: Manylion yr adborth

source: Please don’t include bank details or any other personal information.
cy: Peidiwch â chynnwys manylion banc nac unrhyw wybodaeth bersonol arall.

source: Do you want a reply?
cy: Ydych chi eisiau ateb?

source: Enter your email address if you’d like a reply. We won’t use it for anything else.
cy: Nodwch eich cyfeiriad e-bost os hoffech i ni eich ateb. Ni fyddwn yn ei ddefnyddio ar gyfer unrhyw beth arall.

source: Send feedback
cy: Anfon adborth

source: Your feedback
cy: Eich adborth

source: Thank you for submitting feedback about the service.
cy: Diolch yn fawr i chi am roi adborth am y gwasanaeth.

source: There was a problem
cy: Roedd yna broblem

source: Cancel
cy: Canslo

source: Close
cy: Cau

source: How could we improve this page?
cy: Sut allwn ni wella'r dudalen hon?

source: Thanks for your feedback
cy: Diolch am eich adborth

source: Sorry, your message could not be sent. Please try again later
cy: Mae'n ddrwg gennym, nid oedd yn bosib anfon eich neges. Rhowch gynnig arall arni hwyrach ymlaen.

source: Send
cy: Anfon

source: Switch language
cy: Newid iaith

source: Page
cy: Tudalen

source: Page %(page)s of %(page_count)s.
cy: Tudalen %(page)s o %(page_count)s.

source: Manage users
cy: Rheoli defnyddwyr

source: Sign out
cy: Allgofnodi

source: GOV.UK uses cookies to make the site simpler.
cy: Mae GOV.UK yn defnyddio cwcis i wneud y safle’n symlach.

source: Find out more about cookies
cy: Mwy o wybodaeth am cwcis

source: All content is available under the <a href="%(url)s" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
cy: Mae'r holl gynnwys ar gael dan delerau'r <a href="%(url)s" rel="license">Drwydded Llywodraeth Agored f3.0</a>, heblaw lle nodir yn wahanol

source: When you disable a user account, that user will be unable to log in.
cy: Pan fyddwch yn analluogi cyfrif defnyddiwr, ni fydd y defnyddiwr hwnnw yn gallu mewngofnodi.

source: Disable user account
cy: Analluogi cyfrif defnyddiwr

source: Return to user management
cy: Dychwelyd i reoli cyfrif

source: Your account is not correctly set up to manage other users.
cy: Nid yw eich cyfrif wedi cael ei greu yn iawn i reoli defnyddwyr eraill.

source: Please contact us to request your account to be changed.
cy: Cysylltwch â ni er mwyn gofyn i'ch cyfrif gael ei newid.

source: You cannot edit the user account for ‘%(target_username)s’.
cy: Ni allwch olygu cyfrif defnyddiwr ‘%(target_username)s’.

source: Please contact us if you need to change it.
cy: Cysylltwch â ni os ydych angen ei newid.

source: Manage user accounts
cy: Rheoli cyfrifon defnyddwyr

source: Add, view, edit or disable user accounts.
cy: Ychwanegu, edrych ar, golygu neu analluogi cyfrifon defnyddwyr.

source: If a user enters a wrong password too many times, they are locked out for a short period.
cy: Os bydd defnyddiwr yn nodi cyfrinair anghywir nifer o weithiau, bydd yn cael ei gloi allan am gyfnod byr.

source: You can allow them to log in now by clicking ‘Unlock’.
cy: Gallwch ganiatáu iddynt fewngofnodi nawr drwy glicio ar 'Datgloi'.

source: Add a new user
cy: Ychwanegu defnyddiwr newydd

source: Name
cy: Enw

source: Email
cy: E-bost

source: Can manage accounts
cy: Gallu rheoli cyfrifon

source: Actions
cy: Camau gweithredu

source: User can manage other accounts
cy: Gall y defnyddiwr reoli cyfrifon eraill

source: Edit
cy: Golygu

source: Enable
cy: Galluogi

source: Unlock
cy: Datgloi

source: Disable
cy: Analluogi

source: Edit this user account
cy: Golygu'r cyfrif defnyddiwr hwn

source: When you enable a user account, that user will be able to log in again.
cy: Pan fyddwch yn galluogi cyfrif defnyddiwr, bydd y defnyddiwr hwnnw yn gallu mewngofnodi eto.

source: Enable user account
cy: Galluogi cyfrif defnyddiwr

source: Fill in a user’s details to allow them access.
cy: Llenwi manylion defnyddiwr er mwyn iddynt gael mynediad

source: You can give them a general user or an account management role.
cy: Gallwch roi rôl defnyddiwr cyffredinol iddynt neu rôl rheoli cyfrif.

source: Give the user access to:
cy: Rhoi mynediad i'r defnyddiwr i:

source: Create
cy: Creu

source: Save
cy: Cadw

source: Username: %(username)s
cy: Enw defnyddiwr: %(username)s

source: First name: %(first_name)s
cy: Enw cyntaf: %(first_name)s

source: Last name: %(last_name)s
cy: Cyfenw: %(last_name)s

source: Email: %(email)s
cy: E-bost: %(email)s

source: Can manage other users: %(yes_or_no)s
cy: Gallu rheoli defnyddwyr eraill: %(yes_or_no)s

source: Can log in: %(yes_or_no)s
cy: Gallu mewngofnodi: %(yes_or_no)s

source: Enter the user’s Quantum ID
cy: Nodwch Quantum ID y defnyddiwr

source: First name
cy: Enw cyntaf

source: Last name
cy: Cyfenw

source: Role
cy: Rôl

source: Please choose user’s role
cy: Dewiswch rôl i'r defnyddiwr

source: Give access to manage other users
cy: Rhowch fynediad i reoli defnyddwyr eraill

source: Disable user
cy: Allalluogi'r defnyddiwr

source: User account ‘%(username)s’ disabled
cy: Cyfrif defnyddiwr ‘%(username)s’ wedi'i analluogi

source: This user could not be disabled
cy: Nid oedd modd analluogi'r defnyddiwr hwn

source: Disable user account ‘%(username)s’
cy: Analluogi cyfrif defnyddiwr ‘%(username)s’

source: Enable user
cy: Galluogi defnyddiwr

source: User account ‘%(username)s’ enabled
cy: Cyfrif defnyddiwr ‘%(username)s’ wedi'i alluogi

source: This user could not be enabled
cy: Nid oedd modd galluogi'r defnyddiwr hwn

source: Enable user account ‘%(username)s’
cy: Galluogi cyfrif defnyddiwr ‘%(username)s’

source: Unlocked user ‘%(username)s’, they can now log in again
cy: Defnyddiwr wedi'i ddatgloi ‘%(username)s’, gall nawr fewngofnodi eto

source: Edit user
cy: Golygu defnyddiwr

source: User account ‘%(username)s’ created
cy: Cyfrif defnyddiwr ‘%(username)s’ wedi'i greu

source: User account ‘%(username)s’ edited
cy: Cyfrif defnyddiwr ‘%(username)s’ wedi'i olygu

source: Add user
cy: Ychwanegu defnyddiwr

source: Create a new user
cy: Creu defnyddiwr newydd

source: %(prison_list)s and %(prison)s
cy: %(prison_list)s a %(prison)s

source: The new user will be based at %(prison_list)s.
cy: Bydd y defnyddiwr newydd wedi'i leoli yn %(prison_list)s.

source: The new user will not be based at a specific prison.
cy: Ni fydd y defnyddiwr newydd wedi'i leoli mewn carchar penodol.

source: Edit user ‘%(username)s’
cy: Golygu defnyddiwr ‘%(username)s’
